{"country": "United states", "first_name": "Nora", "middle_name": "", "last_name": "Ling", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20171129173614132-686.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["About Nora Ling Lane", "NAMED D MAGAZINE “BEST REAL ESTATE AGENT AND TOP", "PRODUCER IN DALLAS” 2006 - 2021", "When asked about the secret to her success in real estate, Nora Ling Lane will simply", "answer, “The Grace of God.” As the daughter of Dallas real estate legend, Jennie Ling,", "Nora learned how a great work ethic and putting her clients above all else leads to", "results.", "Home buyers and sellers find comfort in Nora’s extraordinary customer service and care", "and enjoy the confidence that comes with having one of the nation’s leading Realtors", "master minding every aspect of their transaction. She believes that honesty and integrity", "are the two ingredients that set market leaders apart. Her motto is, “say what you mean,", "and mean what you say.” For more than 39 years, Nora has primarily sold homes in", "Preston Hollow, Bluffview, Greenway Parks, Devonshire, and Lakewood but specializes in", "the Park Cities, where she, along with her husband, Jody, raised all three of their", "daughters.", "Consistently focusing on the goals and needs of her clients, she has risen to the top of the", "industry where she is recognized for superior service, advanced negotiation skills,", "innovative use of technology, and sophisticated online marketing strategies that include", "personalized newsletters, videos and extensive of social media. Nora has a strong belief", "in handling every aspect of each transaction from start to finish. She will tell you, “My", "clients know when they call me, they get me. No assistant handles any details of my", "transactions.” Simply put, Nora says “I want every client to be able to say ‘job well done’", "and feel that they are my only client…they are too important to let anyone else handle", "any detail of their transactions.”", "In addition, Nora recognizes the importance of relationships, networking and staying", "abreast of the market…always on top of “coming soon” properties. She is a member of", "two exclusive network groups made up of the top Realtors in the area specializing in", "high-end luxury homes. These groups offer firsthand knowledge of properties coming on", "the market, brainstorming, sharing ideas and exposure of current and off market listings.", "Nora’s contributions to her community have been extensive throughout the years,", "including the National Charity League, the Junior League of Dallas, Scottish Rite", "Children’s Hospital and Center of Hope. More recently, when she’s not working, which is", "seldom, she is spending time with her grandchildren.", " "], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 244-4866", "office_phone": "", "social": "", "website": "", "agent_email": "nora.lane@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0314705/nora-ling-lane"}
{"country": "United states", "first_name": "Diane", "middle_name": "", "last_name": "Bearden", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20190204114811782-411.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["As a former marketing director of a prominent Dallas firm, I bring expertise in construction, design and marketing to a top producing real estate firm. I’ve been selling homes in Texas for twenty five years, and specializing in homes in established neighborhoods as well as new builds. Patient and knowledgeable about today’s market and helping all clients find their dream homes is what I know best. Whether relocating from another area, or buying your first home, my team will be there with you every step of the way.", "Professional Specialties", "Historic Homes, New Builds, Single Family Homes, Uptown High-Rises, Farm and Ranch", " ", "Testimonial", "“", "Diane is an excellent real estate professional. She is extremely dedicated to her work. She is thorough, honest and personable. More importantly, Diane is extremely knowledgeable on the housing market. Thanks for all your help.”", "-Denise and Jeff Candelaria", "Testimonial", "“What a delight in knowing Diane and the professional way she shows homes. She found me the forever home that I have been looking for.”", "-Dotty Hixson", "Testimonial", "“Thank you for all your hard work finding us a country home.”", "-Steve and Rose Rivera"], "languages": "", "address": "6318 Gaston Ave, Suite 200 ", "city": "Dallas", "zip_code": "75214", "state": "Texas", "agent_phone": " (972) 655-9356", "office_phone": "", "social": "", "website": "", "agent_email": "diane.bearden@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0463170/diane-bearden"}
{"country": "United states", "first_name": "John", "middle_name": "", "last_name": "Canterbury", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20190911085857273-442.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["As a trusted real estate partner, John Canterbury launched his real estate business in 2017 and has been recognized as a Top Producer every year since then, but his career spans more than 30 years working in the fields of real estate, corporate interior-architectural design and leading private non-profit foundation.", " ", "John initially moved to North Texas to work in the field of commercial real estate. An interest in corporate negotiations and lending led him to the private mortgage insurance industry where he traveled extensively across the country opening local offices and negotiating commercial leases. His extensive background in the often spirited world of commercial lending and contract negotiation coupled with his breadth of experience working closely with high net worth donors in international settings from South Africa to Dubai provided the springboard for his career in residential real estate.", " ", "Most recently, John served as Executive Director of the Dallas-based Wilson Foundation, the private family foundation of the interior and architectural design firm Wilson Associates, founded by Park Cities native Tricia Wilson. Charged with developing the foundation’s financial capacity to support its educational and health initiatives in the developing world, John’s work frequently intersected with the elite clientele to which Wilson Associates catered. He witnessed first-hand the beauty of creating well-appointed spaces for luxury hotels, casinos and private residences.", " ", "Today, his application of the detail-oriented nature of those huge deals to residential transactions provides a superior level of service to his real estate clients. A master negotiator and networker, John took every opportunity to meet with lead designers, architects and key decision-makers to familiarize himself with the projects and project leaders who made each design project possible, helping him develop a keen appreciation for luxury finishes and high-end interior design in international settings.", " ", "During his tenure with Wilson, John increased the foundation’s corpus by 120 percent. His extensive experience working with high net worth individuals in a variety of cultural settings prepared him for the delicate and commanding world of luxury residential real estate.", " ", "John brings his deep roots in the Dallas area and particularly the Park Cities to the Haven Group and the Allie Beth Allman & Associates team. As a resident of the Park Cities, he has a deep appreciation for the charming neighborhoods, beautiful architecture and high-quality educational opportunities that draw people to the area. He moved to Allie Beth Allman to provide an even higher level of service to his ever-growing luxury client base.", " ", "With a passion for helping and serving others, John strives to provide a reassuring presence to his clients during every aspect of the transaction. The hallmarks of his business strategy are fiduciary responsibility and polished negotiating prowess. He strives to treat his clients as he would want to be treated and to represent them with integrity. He is incredibly proud of the fact that his clients have become good friends, and he counts it the greatest compliment when he receives referrals from them.", " ", "John holds an MBA from the University of St. Thomas along with a bachelor’s degree in liberal arts and business administration from the University of Texas at Austin. He originally hails from Houston but has lived in Dallas since 1986. His focus is on Dallas’ premier neighborhoods including Park Cities, Preston Hollow, Oak Lawn, Bluffview, Devonshire, Lakewood and Lake Highlands."], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 912-6404", "office_phone": "", "social": "", "website": "", "agent_email": "john.canterbury@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me320884/john-canterbury"}
{"country": "United states", "first_name": "Olivia", "middle_name": "", "last_name": "Shimkus", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F0c460694-85f6-4eff-abb3-8d2f93bb28b3.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["As a graduate of Texas A&M Olivia holds herself to a standard of excellence, loyalty, integrity, and selfless service to her clients. Her  ", "goal is to build meaningful, lifelong relationships that are based on a foundation of trust with each of her clients. She does this by providing pertinent information, guidance and support that empowers her clients from beginning to end in the buying, selling, or leasing process. She creates an environment that allows her clients to feel confident in her ability to represent their best interest in every transaction.", " ", "Olivia joined forces with The Collective Real Estate Group, a top-producing team in the Dallas market, ", "as these amazing real estate professionals inspire her each day.", "The Collective Group is a group of individuals that care immensely about being a light and bringing value to others. They work extremely hard, go above and beyond, and hold themselves to the highest standard.  This firm specializes in Dallas luxury services across all price points and their marketing and strategy developed by the in-house team is unparalleled and will exceed your expectations by working closely with you to find the perfect fit.", " ", "Olivia currently resides in the State Thomas area of Uptown, Dallas and not only does she have the market expertise, her connection to the community allows her to share all the latest in entertainment, dining, shopping, and so much more!", " ", "If you are considering buying, selling, or leasing a home, please give Olivia a call. She would be honored to help you with the process!"], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (817) 629-8022", "office_phone": "", "social": "", "website": "", "agent_email": "olivia.shimkus@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me325125/olivia-shimkus"}
{"country": "United states", "first_name": "Perry", "middle_name": "", "last_name": "Moore", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-2017120521480898-531.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Perry Moore knows how to take care of his clients. After almost a decade of building high-end custom homes with one of Tarrant County's premier luxury home builders, he knows what it takes to meet high expectations and exacting standards.", "Having built these unique and architecturally significant homes, Perry has a keen understanding of design and quality. He lead the team that built one of the award-winning 2010 Kaleidoscope of Homes properties.", "Together with his background in Retail Management and Building Management, Perry possesses a passion for helping people see their dreams come to fruition. And from this background, Perry has a great eye for detail and style.", "\"Perry's dedication to finding a solution to any objection will be the root to his success in his Real Estate career,\" says a homeowner of one of his custom homes."], "languages": "", "address": "550 Reserve Street, Suite 320. ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " (817) 992-9856", "office_phone": "", "social": "", "website": "", "agent_email": "perry.moore@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me309016/perry-moore"}
{"country": "United states", "first_name": "Elizabeth", "middle_name": "", "last_name": "Shuford", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2Fa9e77b87-dafc-4645-b45d-409178f308d9.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Mothers and daughters, fathers and sons, and many other family configurations have successfully teamed up in real estate for years. In the case of Elizabeth Shuford Conroy and Lauren Shuford Laughry, it’s been a lifelong relationship between the first cousins that has blossomed into a successful professional association in DFW real estate.", " ", "Joining Allie Beth Allman & Associates in August 2022 was a smart, strategic move for the pair, known throughout the market as the Selling Shufords, continuing to build their brand as Senior Vice Presidents with Dallas’s leading luxury brokerage.", " ", "Elizabeth and Lauren have been inseparable for much of their lives. They bring a deep well of knowledge, excellent marketing and negotiating skills, accented by lovely smiles, a can-do spirit, and positive energy to their clients. Since joining forces in 2020, the Selling Shufords has sold over $100 million of real estate all over Dallas. ", " ", "Warm, confident, selfless, and community-connected, the team strives to make clients feel welcome and excited about the home buying and selling process, backed by the deep resources of the market-leading Allie Beth Allman team.", " ", "For the Selling Shufords, their memorable identity goes beyond a standard brand and represents the importance of family. A home is where a family lives, and precious memories are made.", " ", "“Our personal and professional relationships are just so in-sync ... I feel lucky,” explains Elizabeth.", " ", "“We grew up spending every holiday together, so we understand the importance of family. We also know each other like sisters and are able to communicate effectively, and efficiently.", " ", "Selling Shufords excels in a variety of critical areas, including working with clients moving in out of state. The Dallas natives are deeply knowledgeable about the market, and since both have children in public and private schools, they understand the local educational systems intimately.", " ", "Elizabeth is a Highland Park and SMU alumnae, who grew up in the Park Cities.", " ", "“The majority of our business has been in the Park Cities, Preston Hollow, Devonshire, Briarwood, Greenway Parks, Greenway Crest, Midway Hollow, and East Dallas,” she explains.", " ", "One of Elizabeth’s greatest strengths is being a “matchmaker,” as she puts it. “I enjoy being easy to work with,” she says. “But at the end of the day, whether I am on the listing side or the purchase side, we are all working towards the same goal: a successful transaction from start to finish.”", " ", "“I want to make deals happen ... and really enjoy finding creative ways to make it all possible,” she says. “We love working with all types of clients – first-time homebuyers, recent graduates, and growing families with children of all ages, and beyond.”", " ", "Enthusiastic about charitable causes in her community, Elizabeth has co-chaired events for Interfaith Family Services, University Park Elementary School, and served as president of Phi Beta Phi Shining Arrows.", " ", "She and her husband Brian are parents to eight-year-old Emma Kate, and six-year-old Claire and five-year-old Meredith. “My mom, Kathy, sisters Sarah and Emily, and brother William, all live in Dallas with their families,” she says."], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 478-9801", "office_phone": "", "social": "", "website": "", "agent_email": "elizabeth.conroy@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me324584/elizabeth-shuford-conroy"}
{"country": "United states", "first_name": "Mary", "middle_name": "", "last_name": "Katherine", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20170905173015918-224.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Dallas native Mary Katherine MK Roby grew up in University Park and graduated from Highland Park High School. MK then attended Texas Christian University, where she earned degrees in Fashion Merchandising and Speech Communications. She began her career as an event coordinator for a Dallas based wedding and event planning company and is now bringing those skills of organization, attention to detail and client relationships to her residential real estate career.", " MK maintains her focus on each individual client by providing the absolute best knowledge of the market. Her market knowledge and attention to market forecasts allow her to be more helpful with clients. She is highly effective and responsive during all phases of the transaction.", " MK balances her time as an active member of The Dallas Junior League, Slipper Club, Kappa Kappa Gamma Dallas Alumni Group, Genesis Shareholders, and the Young Friends of the Ronald McDonald House of Dallas. Currently residing in Highland Park and a member of Saint Michael and All Angels Episcopal Church, MK enjoys working and living in the community she grew up in.", " MK's core focus is the Park Cities, Preston Hollow, Devonshire, Bluffview, Lakewood, and the Uptown and Oak Lawn neighborhoods."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (972) 380-3447", "office_phone": "", "social": "", "website": "", "agent_email": "mkgoodrich@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0583875/mary-katherine-roby"}
{"country": "United states", "first_name": "Kelly", "middle_name": "", "last_name": "Hansen", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-201710021055453-582.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["A native Dallasite and third-generation Realtor, Kelly knows Dallas and its neighborhoods well. She grew up in a family of real estate professionals and has continued the tradition of bringing the right people and homes together since 2000. Once Kelly graduated from the University of Texas at Austin with a Bachelor of Journalism, she started her real estate career in Dallas. After exemplifying her natural abilities and exceptional marketing strategies in the Dallas market, Kelly delivers valuable, incomparable guidance to her clients at every step of the home buying or selling process. Her experience and innovation help her sellers to sell for the highest value while helping her buyers get the best deal possible.  Commitment, honesty, knowledge and care define the level of service she delivers in every transaction. She has obtained the prestigious CRS designation (Certified Residential Specialist) and the CCS (Certified Condominium Specialist) designation.", "A graduate of J.J. Pearce High School, Kelly has resided and owned investment properties in the Uptown and Oaklawn neighborhoods. She has served on the boards of The Family Place, the Elan Circle of the Dallas Symphony Orchestra League and her Homeowner's Association. Kelly is an Alpha Delta Pi Alumnae. Fluent in French, Kelly enjoys oil painting, cooking, entertaining her friends and traveling with her husband.", "\"Knowledgeable, friendly, and great to work with.\" - Home Buyer ", "\"Kelly Hansen went above and beyond for us and we cannot thank her enough for making our first home purchase so easy!\" - Home Buyer"], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 718-5355", "office_phone": "", "social": "", "website": "", "agent_email": "kelly.hansen@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0478190/kelly-hansen-jekauc"}
{"country": "United states", "first_name": "Rebecca", "middle_name": "", "last_name": "Delgado", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2Fa9e44a37-2cbf-4df0-b9bb-c24c59fca315.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Why choose Rebecca as your real estate agent? She pays close attention to your needs and will work tirelessly on your behalf. Her passion for perfection combined with unmatched devotion creates a sense of ease and importance for her clients. She is communicative, thorough, and she will be alongside you every step of the way.", " ", "Rebecca has lived in Dallas for over ten years and just loves it. She knows all the neighborhoods inside-out and can put her knowledge of the area to work to find your dream home. As a bonus, her connection to the community allows her to share all the latest in entertainment, restaurants, shopping, and so much more. Just ask her!", " ", "She is deeply rooted in her education and does not hesitate to take a challenging situation as a learning experience. Rebecca graduated in 2016 with an Associates Degree in Liberal Sciences. She uses the same level of attention to detail and commitment from her college days to ensure each client receives an unparalleled buying or selling experience. In addition, Rebecca utilizes the latest technologies available in the real estate market to deliver an efficient and smooth transaction.", " ", "When she isn’t working, Rebecca enjoys spending time with her daughter, traveling, being outdoors, and cooking for family and friends. She loves a great book and would be happy to share some of her favorites.", " ", "Rebecca truly believes in giving back to the community in ways that are meaningful and heartfelt. She finds the most joy participating in organizations supporting children in need. For several years she has been involved with the Sadie Keller Foundation. She has donated her time and resources through Sadie’s Sleigh and the Yellow Ball. As of this year, she was sworn in by the Dallas County courts to be a special advocate for children placed in the foster system. As a court appointed special advocate (CASA), she will devote her time and attention to seek the best interest of a child. Ultimately, her goal is to reunite children with their families.", " ", "Dedication and commitment are key elements in Rebecca’s everyday life. She strives to serve her clients in a meaningful and effective way. Clients are always a number one priority in her book.", " ", "Would you like to work with Rebecca? She can’t wait to be your personal real estate agent!"], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (469) 816-1500", "office_phone": "", "social": "", "website": "", "agent_email": "rebecca.delgado@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322837/rebecca-delgado"}
{"country": "United states", "first_name": "Teffy", "middle_name": "", "last_name": "Jacobs", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-2017072618342871-904.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Teffy Jacobs, senior vice president of Allie Beth Allman & Associates, is a native Dallasite and the second-generation in her family to be engaged as a realtor in the residential real estate business. Having grown up in a retail-oriented family, and by working with her top producer mother, Doris Jacobs, exemplary customer service is in Teffy’s blood.", "As a principal of The Doris Jacobs Group and a multi-million dollar Top Producer, Teffy has been honored as one of the “Best Real Estate Agents in Dallas” and “Top Residential Real Estate Producer” from 2019-2022 by ", "D Magazine", " and by ", "Modern Luxury Dallas’", " Dallas Real Estate Awards as a “Leader in Residential Real Estate” from 2016-2022 and a “Power Player” in 2022. Whether Teffy is listing or selling a landmark estate or working with first-time buyers, she is known for her quality service, extensive marketing knowledge, use of best technology, or consummate professionalism. She provides total dedication to her clients – often relying on referrals and repeat business – and is available 24/7. Teffy’s commitment to the latest technology and education consistently challenges her to creatively be “on top of her game”.", " ", "Teffy specializes in Dallas’ most prestigious neighborhoods, listing and selling some of the most prominent properties in the Park Cities, including Highland Park and University Park, Preston Hollow, Turtle Creek, Uptown, the Dallas Arts District, Devonshire, Bluffview, Greenway Parks, Lakewood, North Dallas, Plano and Frisco.", "A graduate of Highland Park High School and the University of Southern California (USC) with a Bachelor of Arts from the Annenberg School of Communications, Teffy’s past professional experience includes working in sales and marketing positions for the Fortune 500 companies’ FedEx Kinko’s, Eastman Kodak Company and CrossLand Mortgage Corporation, where she was involved in strategic marketing, communication campaigns, branding, advertising, social media, corporate and convention services sales, business development, trade show and special event planning, mortgage banking, client relations, direct mail and internal relations. In 2003, Teffy decided to utilize her talents and join the family business at Doris Jacobs Real Estate, where she continues to work to this day.", " ", "By following her mother’s example, Teffy innately assumes work, family life, and volunteerism as her personal responsibility. She has been involved with numerous charitable events and social organizations in the Dallas/Fort Worth area, including serving on the Board of the Turtle Creek Park Conservancy and is a long-standing member of the Cattle Baron’s Ball and the Junior League of Dallas. Other charities Teffy is involved in include: KidneyTexas, Inc., Family Place, Dallas Symphony Orchestra League, Dallas Museum of Art, Pi Beta Phi Alumni Club, John Wayne Foundation, TACA, Community Partners, Heroes and Handbags, Texas Ballet Theater, American Red Cross, Equest, Leukemia & Lymphoma Society, Trinity River Mission, Dallas Habitat for Humanity, Salvation Army, Dallas Heritage Village and the Dallas Heart Ball.", " ", "Currently residing in the Park Cities Vicinity of Bluffview, Teffy is a member of the Highland Park Presbyterian Church and a proud supporter of the Highland Park Independent School District."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 676-3339", "office_phone": "", "social": "", "website": "", "agent_email": "teffy.jacobs@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me292112/teffy-jacobs"}
{"country": "United states", "first_name": "Lindsey", "middle_name": "", "last_name": "Malloy", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-2018080815334345-189.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["After graduating from University of Texas, Lindsey Bradley Malloy started her successful real estate career in 2012. She quickly found her passion for connecting her clients to their dream homes in Dallas. She has earned Top Producer and D Magazine's Best Realtor several years. ", "Recognized for her knowledge and expertise in the Dallas real estate market, Lindsey specializes in the Park Cities, Preston Hollow, Midway Hollow, M-Strees/Lakewood, Uptown, and Devonshire where she and her husband, George, reside along with their two baby girls. Lindsey attributes her success in real estate to the personal commitment she gives to each and every client.", " ", "Lindsey’s unmatched work ethic, innovative approach to marketing, and strong networking abilities allows her to better serve her clients to find homes prior to hitting the market and get top dollar when selling their home.  "], "languages": "", "address": "5015 Tracy St 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (940)636-9086", "office_phone": "", "social": "", "website": "", "agent_email": "lindsey.malloy@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me318376/lindsey-malloy"}
{"country": "United states", "first_name": "Anne", "middle_name": "", "last_name": "Kashata", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-2018122611532986-511.jpg", "title": "Real Estate Professional", "office_name": "", "description": [], "languages": "", "address": "5015 Tracy St #102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214)356-7200", "office_phone": "", "social": "", "website": "", "agent_email": "anne.kashata@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me319030/anne-kashata"}
{"country": "United states", "first_name": "Sada", "middle_name": "", "last_name": "Millican", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20170831113226342-916.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["The customer care and commitment begins with hello, and it never ends. That’s the level of service and dedication that Sada Millican has provided North Texas home buyers and sellers for over 25 years.", "“I become very attached to the people that I have the opportunity of bringing together with the right home,” says Sada, who has lived and been involved in the Dallas community for over 40 years. “Years ago I drove past a darling Tudor home in the M Streets that I sold a young couple, and sitting in front was an empty baby stroller box. I just had to stop and get the family news.” The past customers were delighted to inform Sada that their first child was due the following week. Two more children later, Sada has since sold that home and helped them in the purchase of another home for their growing family.", "There are so many stories like that that are the true testament to the high quality of service, expertise and long-term commitment that Sada offers. Generations of relocating families and individuals have trusted her with the purchase or sale of their most important investment, their home.", "Beyond the personal touch, Sada Millican brings to her customers a broad knowledge of numerous communities in the Metroplex. Formerly a legal assistant to a real estate attorney, she melds her marketing and sales skills with a meticulous attention to deliver the best results in the shortest time possible.", "“Knowing so many neighborhoods, I am able to help my home buyers quickly zero in on the areas that best fit their budget and needs,” explains Sada. “This also helps me to target market the listings I represent to the most likely candidates for a property and its lifestyle.”", "An active volunteer in the community, Sada Millican and her husband of over 40 years raised their grown sons in the Dallas area. Her roots are equally deep in the real estate community where she has established a network with her colleagues and a strong reputation for integrity and drive.", " “I am dedicated to being an efficient, effective and professional businesswoman,” says Sada Millican. “Allie Beth Allman & Associates is a firm that stands above all of the others in providing an environment that empowers excellence in all that we do for our customers.”"], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 264-3513", "office_phone": "", "social": "", "website": "", "agent_email": "sada.millican@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0365631/sada-millican"}
{"country": "United states", "first_name": "Carolyn", "middle_name": "", "last_name": "Philpott", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-2019020716304188-354.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Carolyn began her career in real estate sales after having been a high school counselor in Tulsa and at J. J. Pearce in Richardson, Texas. She has extensive experience in working with corporate relocations in high level professions. Being very knowledgable of the metroplex, she has been able to satisfy clients' need in a wide range of areas with various requirements. Due to her enthusiasm and responsible attitude toward her clients, approximately 80% of her business has come from former clients and their referrals.", "She believes it is extremely important that clients be informed and understand the buying and selling process. Communication, as well as knowledge, is key to successful transactions.", "Education:", "• Green Living Specialist", "• Sr. Real Estate Specialist", "• Home Staging", "• Member: Northwood Woman's Club", "• Member: MetroCare of Dallas", "• Bachelor's Degree in Art", "• Master's Degree in Psychology", "• Real Estate Broker's License", "Carolyn is active in her church, is a dog lover and has two adult daughters."], "languages": "", "address": "5015 Tracy St #102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 235-2996", "office_phone": "", "social": "", "website": "", "agent_email": "carolyn.pearson@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me319368/carolyn-philpott-pearson"}
{"country": "United states", "first_name": "Shane", "middle_name": "", "last_name": "Taylor", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2Ff4ea8e02-83d8-41d6-b79f-f2768eb2df90.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["I am pleased to share with my friends and neighbors that I have the good fortune to have joined the Allie Beth Allman & Associates real estate group in Southlake, TX.  I am equally blessed to be aligned with the exceptional Nannette Ecklund-Luker team. ", "As you know, my experience in buying and selling homes and condominiums has been continually active over the years.  I combine that buying and selling with over 33 years of corporate finance experience to create a perfect fit to assist in your residential real estate needs.  I also work with my wife Leshia who has extensive experience in staging homes for sale should the need arise.", "Allie Beth Allman is well known throughout the region for the incredible work they do marketing properties they are entrusted to list.  Your home will be on numerous platforms where buyers turn for current real estate information.  The reputation and deep experience of Nan’s team combined with the reputation of Allie Beth Allman makes for a perfect match.  I would appreciate the opportunity to assist you or your contacts if you require assistance or just want to discuss your future real estate plans. ", "Thank you for considering me for any buying or selling real estate needs that you or someone you know might be considering.  Please let me know if I can assist in any way."], "languages": "", "address": "500 Reserve St., Suite 320 ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " (214) 679-9889", "office_phone": "", "social": "", "website": "", "agent_email": "shane.taylor@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me321961/shane-taylor"}
{"country": "United states", "first_name": "Gretchen", "middle_name": "", "last_name": "Gerlach", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F3480f34e-b0e7-4428-86ba-be497c77b361.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Gretchen joined Allie Beth Allman after many successful years in global sales and leadership in technology industry. Gretchen’s career and reputation are built on her commitment to partner satisfaction and exceptional attention to detail. Her goal is to streamline the real estate process through quick and efficient transactions at the best possible value. ", "Gretchen specializes in Dallas real estate in the University Park, Highland Park, Preston Hollow, Lakewood, North Dallas, Bluffview, Turtle Creek, and surrounding areas. With a longtime passion for real estate and design, she looks forward to delivering seamless real estate services to her clients, so they are able to enjoy the search for their new homes.  Please reach out to Gretchen for assistance with up-sizing, down-sizing, or leasing needs.", "On a personal note, Gretchen moved to Dallas from Palm Beach and graduated from SMU, Cox School of Business.  She has held various board positions, including President of The Stewpot Alliance and a board member of The Elisa Project.  She supports SMU, the SPCA and The Stewpot Alliance. For fun, she likes to travel near and far, entertain friends, exercise and walk her beloved dog Molly."], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 663-4001", "office_phone": "", "social": "", "website": "", "agent_email": "gretchen.gerlach@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me323197/gretchen-gerlach"}
{"country": "United states", "first_name": "Katy", "middle_name": "", "last_name": "Tomaszczuk", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20191111152351151-684.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Katy grew up in Washington D.C. and settled in Dallas after graduating from the University of Oklahoma in 2013. Upon graduation, she obtained her Texas real estate license and worked for Keller Williams before joining Allie Beth Allman & Associates in early 2015.", "She is passionate about forging relationships with clients, and has sold extensively in Midway Hollow, Preston Hollow, Uptown and East Dallas. She is also actively involved in the onsite leasing and marketing of The McKenzie.", "Katy has volunteered for a multitude of community service organizations, including CASA and the Junior League of Dallas."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 490-9845", "office_phone": "", "social": "", "website": "", "agent_email": "katy.avrea@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me297066/katy-tomaszczuk-avrea"}
{"country": "United states", "first_name": "Pete", "middle_name": "", "last_name": "Livingston", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F90d39781-a681-44c3-8a47-6d5ac8f62004.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Pete Livingston has been a licensed Texas real estate agent for more than 40 years. A Dallas native, Pete graduated from Highland Park high school, he attended the University of Arkansas and the University of Texas at Dallas where he majored in business, economics, finance and psychology. Pete is a consistent top producing agent with many production awards. He is a motivated Realtor, who brings a latitude of experience and work ethic to the residential real estate market. Having been a home builder, multi- family developer, and commercial property broker, Pete brings extra buying and selling skills to his clients.", " ", "Socially Pete is athletic, he walks, and runs most days. Pete loves the outdoors, old cars and has a passion for historic homes and early Texas fine art."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 505-5005", "office_phone": "", "social": "", "website": "", "agent_email": "pete.livingston@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me300309/pete-livingston"}
{"country": "United states", "first_name": "Goni", "middle_name": "", "last_name": "Ahmedi", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F98c2f2f8-e5cf-40b7-bfa2-67843a72302a.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Goni Ahmedi is an associate with Perry, Wisdom, Barrett Real Estate Group, the number one producing group at Allie Beth Allman & Associates. In 2021 the group generated over 500 million dollars in sales.", " ", "Goni is a hardworking dedicated agent that specializes in the areas of Highland Park, University Park, Preston Hollow, and North Dallas.", " ", "Goni was born and raised in Dallas, Texas. His family has been in the restaurant business in DFW for over 30 years. Goni has run one of his family's locations since a young teenager and has grossed over 10 million dollars in sales. Goni plans on taking his passion and training in the restaurant industry and bringing it to his clients at Allie Beth Allman & Associates."], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (817) 991-9787", "office_phone": "", "social": "", "website": "", "agent_email": "goni.ahmedi@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me323151/goni-ahmedi"}
{"country": "United states", "first_name": "Kate", "middle_name": "", "last_name": "Busch", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F84a402ff-a09d-49f2-9f40-f7589e3fb121.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Kate’s interest in real estate sparked early on. She worked her way through college before starting a marketing job with a luxury home builder. Impressed with her work, Kate’s boss suggested she pursue a career in real estate. She obtained her real estate license in 2003 and has been working in the business ever since. ", " ", "In 2015 ", "Kate joined a top producing real estate team in Dallas.  ", "Kate works hard to stay current on the rapidly changing Dallas market.  Her extensive connections and membership in exclusive network groups provide her with the inside track on market knowledge and hip-pocket listings in Dallas' hottest neighborhoods. Her social media and marketing skills help keep her listings and buyer needs in front of a large audience and the area's top agents. Having worked with buyers and sellers at various price points, Kate understands that every transaction is different and requires a customized plan for success.", " ", " ", " ", "Married to a real estate executive, Kate enjoys living and raising her family in Dallas.  She loves volunteering at her children's schools, being active in the community and spending time with her family and friends.  Kate has a unique perspective on the world and a passion for travel, new people and cultures."], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 498-6465", "office_phone": "", "social": "", "website": "", "agent_email": "kate.busch@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me323521/kate-busch"}
{"country": "United states", "first_name": "Mellie", "middle_name": "", "last_name": "Cline", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20170628151849398-310.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Prior to becoming a Realtor, Mellie was a full-time wife, mother and energetic volunteer. Her charitable activities and fund-raising efforts benefited the fine arts in Houston, Amarillo, Denver and Dallas. As a member of the National Committee of the American Friends of Versailles she raised funds to restore the Trois Fontaines Bosquet and more recently the Pavillon Frais. Admitted to the Houston Junior League in 1978, she was an active affiliate in leagues in Amarillo, Denver and Dallas and is now a Sustainer in the Dallas Junior League.  Mellie is a Zeta Tau Alpha alumna of the University of Texas Kappa Chapter. ", "In her first year as an agent, Mellie achieved Multi Million Dollar Producer status and was honored as the Allie Beth Allman Rookie of the Year.  She has been featured in D Magazine as a Best Real Estate Agent in Dallas, and in Texas Monthly Magazine as a Five Star Professional Real Estate Agent.", "Mellie’s proficiency and commitment to excellence and lifelong learning are demonstrated in the many elite Professional Designations she has earned including the ePro; Graduate, Realtor Institute; Certified Luxury Home Marketing Specialist; Certified Historic Home Specialist; and Certified Residential Specialist. ", "As a long-time resident of University Park, Mellie chooses to specialize close to home in the Park Cities, Greenway Parks, Bluffview, Preston Hollow, Lakewood and the M Streets, Oak Lawn and Uptown.", "Known for her dedication to her clients’ needs, she has built her business on their enthusiastic referrals: ", "”What most distinguishes Mellie from other realtors we’ve worked with is her single-minded commitment to lifelong client service.” ", "”We’ve bought several houses, and worked with many realtors, but Mellie’s dedication exceeded any real estate experience we’ve had. She anticipated our needs and provided valuable information and help through it all.” ", " ", "”I’ve never had a realtor who so clearly understood what I wanted. Mellie makes the entire process a pleasure. We have recommended her to every last one of our friends.”  "], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 267-8267", "office_phone": "", "social": "", "website": "", "agent_email": "mellie.cline@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0512941/mellie-cline"}
{"country": "United states", "first_name": "Susan", "middle_name": "", "last_name": "Conway", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-201910071336438-532.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["As a real estate partner, Susan Conway brings more than a decade of experience in outside sales, relocation to and from Dallas, and new home construction to the business of existing home sales and residential real estate. Susan leverages her extensive background in new home construction and sales to help guide her clients to find the home of their dreams. With a love of residential architecture and a keen eye for new construction trends and high-end finish out, she applies market knowledge of current design to serve her clients in buying, selling, and maintaining the investment of residential real estate.", "As a member of Allie Beth Allman and Associates Relocation Team, Susan has a vast knowledge of the neighborhoods in Dallas, as well as surrounding cities and counties, such as: Highland Park, University Park, Dallas, North Dallas, East Dallas, Uptown, Oak Lawn, Oak Cliff, Plano, Frisco, McKinney, Allen, Southlake, Colleyville, Keller, Richardson, Lewisville, Flower Mound, Coppell, Carrollton-Farmers Branch, Irving, Las Colinas, Garland, Rockwall, Rowlett, Forney, Fort Worth, Arlington, Kaufman, Denton and Ellis Counties.", " ", "Susan received her degree in business in 2009 from the University of Alabama and immediately went to work in sales for a nationwide construction products company. A natural love of residential architecture led her to a successful career in new home sales where she generated more than $26 million in sales volume over five years supporting new home sales at developments in the Lake Highlands, Lakewood, and Oak Lawn neighborhoods of Dallas. With patience and extensive knowledge of new home finishes, construction products, and home financing, Susan is privileged to spend the time helping clients in buying and selling their homes. ", "Susan knows that buying or building a home is one of the most expensive and emotional investments a family will ever make. She lends her wealth of experience in working with families as they build their dream homes to helping her clients make the most of their purchase of residential real estate. She strives to apply her knowledge of home building to helping clients achieve their goals. In addition to her expertise in helping clients buy and sell their homes, Susan strives to maintain an extensive database of vendors who can help her clients maintain and preserve the value and integrity of their property so that when the time comes to sell, they are ready to hit the market with excellence. Client service and making sure clients are happy with every aspect of their home sale is crucial to her success.", "Susan lives in Lake Highlands with her husband Jimmy, who works full-time for BNY Mellon, as a Wealth Director. Faith and family have always been a top priority for Susan – she has a four-year-old daughter and one-year-old son who keep her busy. She is also very active in her community and is currently on the board of the Lake Highlands Junior Women’s League and is also involved in the Lake Highlands Early Childhood PTA, 100 Women of Lake Highlands, and the Slipper Club of Dallas, of which she was past board president."], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 335-6646", "office_phone": "", "social": "", "website": "", "agent_email": "susan.conway@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me321034/susan-conway"}
{"country": "United states", "first_name": "Noreen", "middle_name": "", "last_name": "Humenesky", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20171129172935425-871.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Noreen is a Real Estate Broker Associate and Relocation Specialist with a track record of over 25 years’ experience and success in the real estate industry.  She has specialized in relocation and builder representation and marketing and has assisted corporate transferees in their home finding and home sale transactions as well as acted as a resource for the corporate transferees during their moves. It has always been important to her that she maintain the highest level of customer service and represent well the high standards embraced by Allie Beth Allman & Associates.  She has been able to accomplish this by utilizing real estate market knowledge, area and community knowledge and keeping abreast of new rules and regulations in the industry.  She prides herself in being organized and in regular communication with the parties so that all remain informed throughout the transaction.  Noreen has established successful relationships and worked with many relocation companies and corporate clients throughout the country.  She maintains active real estate brokerage licenses in both Texas and California and is proud to be a part of Allie Beth Allman & Associates, the premier real estate company in Dallas.  The Company is recognized as the most productive residential real estate firm in Dallas and offers superior service in Dallas and surrounding markets.", "Noreen has lived in Plano, Texas for over 20 years and specializes in the Plano, Frisco, Celina, Prosper, North Dallas, McKinney, Allen, and Richardson areas.  Her children have attended school and participated in sports, dance, gymnastics, camps, and religious activities in the community.  Over the years, she has developed a network of contacts and resources to assist transferees as they seek to transition their families to a new State, a new home, and new schools for their children.", "Giving back to the community she serves is important to Noreen and, toward that end, she is an active member of several philanthropic organizations dedicated to assisting the less fortunate in the local communities.", "Her prior experience includes working with relocating buyers and sellers in both Northern and Southern California and as a Sales Manager for several new home communities.   With the support of management, she developed and implemented a marketing plan to increase sales and move inventory.  In that capacity, Noreen was consistently recognized as a top producer by the Sales and Marketing Council (SMC) and nominated as SMC’s Salesperson of the Year and MAME finalist."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 906-8583", "office_phone": "", "social": "", "website": "", "agent_email": "noreen.humenesky@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me299132/noreen-humenesky"}
{"country": "United states", "first_name": "Tonia", "middle_name": "", "last_name": "Beard", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81691%2F528-20190227165927886-425.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Tonia Beard has lived in the Dallas Fort Worth Metroplex her entire life.  She grew up in Dallas and moved west when she married Fort Worth native Scott Beard.  Tonia and Scott have lived in Trophy Club since 1999 where they have raised their two children.  Tonia has dedicated many years serving and investing in her community, schools, church and her family.", "Tonia has always had a passion for residential real estate and is a knowledgeable guide to the community and surrounding areas.  Having worked for one for the largest custom home developers and several custom home builders, she is very educated about construction and neighborhood development.  Tonia represents both buyers and sellers and takes a relationship-focused approach to each client, intent on providing the highest personalized service and striving for excellence in all that she does.", "The continual referrals and repeat business that Tonia receives is a testament to her passion for others.  She brings her clients more than just her experience; she brings the network and prestige of Allie Beth Allman. "], "languages": "", "address": "550 Reserve Street, Suite 320. ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " (817) 301-4401", "office_phone": "", "social": "", "website": "", "agent_email": "tonia.beard@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me309018/tonia-beard"}
{"country": "United states", "first_name": "Kelly", "middle_name": "", "last_name": "Morgan", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20180412165226987-686.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["With a vast skill set that includes finance, negotiation, and networking, Kelly Morgan is a knowledgeable real estate agent in the Dallas area. Home purchases are one of the largest personal transactions that her clients experience, and they are reassured knowing Kelly offers exceptional market knowledge and a positive approach to each real estate transaction.", " ", "Born in Washington, D.C., and raised on the east coast and then Colorado, Kelly has plenty of experience moving from one home to another. She attended college at the University of Florida where she earned a degree in Finance. She worked at a big four accounting firm specializing in economic and valuation services and valued assets that included property for companies worldwide.  An interest in sales led Kelly to switch careers and work in medical device sales for a large medical company.  It was a combined love of finance and sales that eventually drew her to a career in real estate. Today, Kelly loves helping clients find or sell homes and investment properties and finds this work truly rewarding.", " ", "Living and working in the University Park area, Kelly specializes in Dallas proper and the surrounding areas. Hardworking and determined, she listens carefully to the needs of her clients and utilizes extensive market knowledge and networking to assist them in finding the right home. Kelly is naturally caring and detail-oriented, a perfect combination for a successful realtor. She loves the community vibe embedded in her neighborhood as well as the friendliness of the people in Dallas. She will stop at nothing to help her clients find a neighborhood that fits them just as well.", " ", "Kelly is a dedicated businesswoman, wife, and mother.  Her husband and their three children live in University Park.  She is involved in her children’s schools, Women’s Auxiliary to Children’s Medical Center, Dec My Room, and her church. When she takes time for herself, she enjoys spending time with her family and living an active lifestyle."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 470-8439", "office_phone": "", "social": "", "website": "", "agent_email": "kelly.morgan@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me309082/kelly-morgan"}
{"country": "United states", "first_name": "Rachel", "middle_name": "", "last_name": "Trowbridge", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F80c00b08-76c6-4a0e-b6a4-21c4081dba3d.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Named by D Magazine as one of \"The Top Producers in Dallas,\" fourth-generation Dallasite Rachel Stanzel Trowbridge has the neighborhood history, negotiating skills and attention to detail that make her one of the best in residential real estate. ", "These achievements can be traced to her inclusion in private networking groups, ability to listen to client desires and to remain detail-oriented and analytical. She is also a relocation specialist with great insights on neighborhoods, schools and property value.  She has represented international clients and company executives relocating to Dallas.  ", "Having worked for nearly a decade at one of the top 100 law firms in the nation, she managed marketing and client development for the firm's Dallas office of nearly 200 attorneys. She understands the importance of confidentiality, professionalism, putting the client first and straightforward communication.", "Her business focuses on the Park Cities, Preston Hollow, Greenway Parks, Bluffview, Briarwood, Uptown and Downtown Hi-Rises.  ", "Rachel and her husband live in Highland Park with their three daughters. She is active in the Dallas philanthropic community and in the schools her children attend, The Lamplighter School, Bradfield Elementary, and Highland Park Middle School."], "languages": "", "address": "5015 Tracy St #102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214)395-3702", "office_phone": "", "social": "", "website": "", "agent_email": "rachel.trowbridge@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me318807/rachel-trowbridge"}
{"country": "United states", "first_name": "Meredith", "middle_name": "", "last_name": "Taylor", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20180612101257295-119.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Meredith Taylor is passionate about serving others with integrity, professionalism and empathy.  Listening and asking important relevant questions to facilitate a true understanding of her client’s situation and desires is one of Meredith’s greatest strengths.", "Meredith Taylor is partnered with the Lillie Young Team, one of the top-producing real estate teams in the Dallas Market. She is a member of the National Association of Realtors and the Texas Association of Realtors. From working with a first-time home owner to listing a client’s second vacation home, she will meet you where you are. Meredith has a strong understanding of the market and local housing trends, and is open to working with clients throughout the DFW area.", "Meredith believes buying and selling a home is not only an important financial investment, but an emotional decision as well.   Where you live, you love. She is dedicated to providing value, knowledge, and exceptional support and guidance throughout the process. Meredith is grateful for the relationships built through her work, and donates a portion of each sales commission to a non-profit organization of her client’s choosing.", "As a lover of dogs, nature, community and music, Meredith has called East Dallas home since 2005. She grew up in the DFW area and is a proud graduate of Texas A&M University."], "languages": "", "address": "5015 Tracy St Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 718-2545", "office_phone": "", "social": "", "website": "", "agent_email": "meredith.taylor@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me310120/meredith-taylor"}
{"country": "United states", "first_name": "Debbie", "middle_name": "", "last_name": "Ingram", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F529e92cb-70dd-410a-a0ac-88b4592a997c.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Brokering residential real estate in Dallas’ finest neighborhoods for nearly four decades, Debbie Ingram is a Dallas native who knows Dallas real estate unlike any other agent. Debbie’s clients have benefited from her extraordinarily detailed knowledge of the Dallas neighborhoods, the depth of her experience with negotiations, her unending tenacity, and her intuitive sense of the other parties involved. Debbie provides a consistent level of clear communication and assertive representation on every client’s behalf, and she has the ability to make a deal work—no matter the parties or complications involved.", " ", "She has a track record for putting buyers and sellers together, often without the properties ever coming on the market—an invaluable advantage for her buyers, particularly throughout the past two years.", " ", "Debbie not only matches the right buyer to the right house, but she can also explain the nuances of distinct neighborhoods, block by block.", " ", "Debbie remarks that “Many of my clients become long-term friends. It’s not uncommon for me to have represented three generations of buyers and sellers within the same family. I consider it an honor to serve as their trusted advisor and my greatest fulfillment is when clients tell me that I have made the process easy and enjoyable. I love people, serving others, homes, architecture, and I love the art of a structuring deal. I am blessed that my work is not simply my profession, but my job is my passion!” For more information, please look at ", "www.debbieingram.com"], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 680-5353", "office_phone": "", "social": "", "website": "", "agent_email": "debbie.ingram@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0314738/debbie-ingram"}
{"country": "United states", "first_name": "Claire", "middle_name": "", "last_name": "Amaker", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F79521ec9-5256-4733-bf41-891a377a7b03.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Claire", " Oliver ", "Amaker", " is an exceptionally hard worker who is enthusiastic about helping her friends and family find their perfect homes. ", "Claire", " grew up in Highland Park and graduated from HPHS. She attended the University of Georgia, graduating magna cum laude in 2017. She went on to attain her master's degree from the University of Georgia, again graduating with honors. ", "Claire", " then worked for four years as an elementary school teacher. As a former educator in the Highland Park school district, ", "Claire", " knows the personal nuances and details of local schools that allow you to select the best fit for your family.", "Having grown up in Highland Park and now residing in Lakewood, Claire has a broad knowledge of several premier Dallas neighborhoods. Claire grew up in an entrepreneurial family that included remodeling and updating residential properties. From this experience, Claire gained useful knowledge in home design and the potential for effective remodeling on a budget.", "Claire’s youthful exuberance is an asset in the real estate world today. Her organizational skills, confident energy, hard-working mentality, and personable demeanor are attributes that set her apart as she embraces old friends and new acquaintances as clients. When you hire Claire, she will cover the buying or leasing process from start to finish with attention to detail, knowledge, and excitement in securing your starter or dream home. ", " ", "Claire is", " involved in supporting the Dallas community through her service to Dallas CASA, The Birthday Party Project and her work as a board member of DFW University of Georgia Alumni Chapter.  She is also actively involved in the Dallas alumni group of Kappa Alpha Theta and is a member of Highland Park Presbyterian Church."], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 886-7391", "office_phone": "", "social": "", "website": "", "agent_email": "claire.amaker@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322898/claire-amaker"}
{"country": "United states", "first_name": "Breeanna", "middle_name": "", "last_name": "Joubran", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20170828160720266-789.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Breeanna Joubran is proud to be a part of the #1 firm in Dallas at Allie Beth Allman & Associates. We are a group of highly renowned, motivated, business professionals who consistently perform and produce superior results for our clients. Breeanna prides herself on integrity, loyalty and a client for life philosophy. Breeanna excelled at Southern Methodist University and was able to complete her degree in International Business in 3 years. As part of her achievements in school, Breeanna was selected to study abroad in 4 different countries while representing SMU. Prior to living in Dallas, Breeanna grew up in Southern California. Breeanna is devoted to serving the needs of real estate buyers and sellers throughout Dallas including Preston Hollow, ", "Lakewood, the Park Cities,", " ", "Forest Hills, Lake Highlands, M streets, and Lower Greenville just to name a few. She lives in Preston Hollow with her husband and three daughters. Prior to becoming a Realtor, Breeanna was a top executive in the ", "health care", " industry representing billion-dollar revenue generating clients. She brings a deep understanding of how to represent her clients through every facet of a transaction including contracts, negotiations and ultimately the closing day celebration. Breeanna is a strong supporter of her community and is an active participant within many organizations.", "I feel incredibly fortunate to be able to serve as a trusted real estate advisor in the Dallas market. Being a part of such a meaningful event as buying or selling a property is truly rewarding. Whether I am working with friends, family or referrals, I genuinely am able to connect with my clients. To perform at the optimum for a client, I excel at the following: listening, technology, design, finance, marketing, market knowledge, communication, among many others. I will do whatever it takes to get you to where you want to be!", "Let's Talk Business!", "Whether you are buying or selling I have the resources to provide you with results. I would love to be part of such an important event in your life! Breeanna Joubran is available for all of your real estate needs."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " 214-997-5000", "office_phone": "", "social": "", "website": "", "agent_email": "breeanna.joubran@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me302940/breeanna-joubran"}
{"country": "United states", "first_name": "Diana", "middle_name": "", "last_name": "Nelson", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F43926f55-a96c-41b0-bdb8-70e294e71f29.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Persistent, personable and passionate. Diana Whitworth Nelson knows the path to success is creative problem solving, connecting people and hard work. Helping others is her reason for being but surpassing their expectations inspires her most.", "Diana grew up in the Rio Grande Valley where her parents published a newspaper and instilled the lessons of small business ownership—how to get things done. After graduating from Southern Methodist University in 1996 she embarked on a decades long career in publishing for Dallas magazines: ", "D Magazine", ", ", "Lakewood Advocate", " and ", "DFWChild", " establishing her as an expert on the people, places and neighborhoods that make Dallas one of the fastest growing cities in the U.S. In fact, she has gladly shared this knowledge to help more than one out-of-town business strategically select their neighborhood.", "“Collaboration is fun,” says Nelson. “I love to see how my knowledge and experience can contribute to the happiness and success of others.”", "Diana is also the mom next door. When she is not working, she and her husband Joel are making new friends at their three kids’ schools, sporting and social events, delivering Meals on Wheels or volunteering at other Dallas organizations.", "Email diana.nelson@alliebeth.com or call 214-598-1135 to learn how Diana and Allie Beth Allman & Associates can help you."], "languages": "", "address": "6318 Gaston Avenue #200 ", "city": "Dallas", "zip_code": "75214", "state": "Texas", "agent_phone": " (214) 598-1135", "office_phone": "", "social": "", "website": "", "agent_email": "diana.nelson@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me324861/diana-nelson"}
{"country": "United states", "first_name": "Tric", "middle_name": "", "last_name": "Sohosky", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F975032b4-8c3a-41a6-acdf-5136e88bc0c8.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["As a member of the award winning Redpath Team, Tric ensures her clients receive priceless expertise as they make one of the most important investments in their lives.  Tric also shares the team’s commitment to exceptional service, strong work ethic, and drive to excel.  She brings her own unique background in education as well as a good eye for staging and preparing homes for the market.  Her skills are enhanced by deep roots in the community where she has first hand knowledge of the areas top hand schools and neighborhoods. ", " ", "Tric loves helping people and has a genuine desire to make others happy, both in her professional endeavors and as involved member in the community where her family lives and her children attend school.  She is involved in the PTA Boards at all three of her children’s schools as well serving on the board for National Charity League and an Alumnae of Alpha Delta Pi.  "], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 673-8258", "office_phone": "", "social": "", "website": "", "agent_email": "tric.sohosky@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me321440/tric-sohosky"}
{"country": "United states", "first_name": "Lou", "middle_name": "", "last_name": "Moore", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2Fe33cdd9e-f02f-4028-876f-f91ed2555e96.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Over the last 25+ years Lou Moore has been a consistent top producer in real estate listings and sales in the Dallas Metroplex. ", "The key to Lou's success is really listening to her clients wants and needs and applying them to her expertise, market knowledge and negotiating skills ", "In addition to her real estate career, Lou was in advertising in New York for 15 years."], "languages": "", "address": "6318 Gaston Avenue #200 ", "city": "Dallas", "zip_code": "75214", "state": "Texas", "agent_phone": " (214) 632-6584", "office_phone": "", "social": "", "website": "", "agent_email": "lou.moore@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322243/lou-moore"}
{"country": "United states", "first_name": "Kristen", "middle_name": "", "last_name": "Thornhill", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-2017092112293717-702.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Well-respected and hard-working, Kristen Adams Thornhill joined the Sullivan Tillery Group at Allie Beth Allman in 2016. Kristen is a Dallas native, graduating from Highland Park High School and Texas Christian University in Fort Worth. She has grown up in the real estate world with a father who works in commercial, and has had much experience with customer relations. She has years of transactions under her belt and goes the extra mile for her clients. ", "Kristen is caring, kind, and trustworthy. Her desire to always put clients first is what makes Kristen stand out. She is a problem-solver with a tenacious drive to succeed. Her knowledge of the market, combined with her personable and calm demeanor, makes working with her a no-brainer. She is a \"D Magazine Best Realtor\" and her ", "youthful exuberance is a prominent asset in the real estate world today."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 537-3582", "office_phone": "", "social": "", "website": "", "agent_email": "kristen.thornhill@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me301392/kristen-thornhill"}
{"country": "United states", "first_name": "Kim", "middle_name": "", "last_name": "Dale", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20190801113923274-834.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["With 20+ years of commercial, residential and retail real estate advertising and marketing experience, Kim brings a wealth of expertise to residential sales. Able to expertly position and market each unique property, she represents clients with passion, dedication and a higher level of service.", "Her keen eye for detail and Interior Design degree from TCU offer sellers the help they need to carefully stage and showcase their property for maximum value. Buyers will appreciate her vision and expertise in seeing the untapped potential in a prospective property. And both will benefit from her vision and experience, after renovating three of her own Park Cities and Greenway Park area homes over the past 25 years.", "Having lived and raised her family here, Kim has a large network of friends, associates and resources that can help you make wise real estate decisions and take full advantage of what this community has to offer. A volunteer with numerous area non-profits and former chair and dedicated committee member for the HPISD, her inside knowledge is a tremendous resource when choosing the perfect neighborhood.", "Kim's combination of interior design talent, remodel experience and real estate expertise makes her an invaluable partner who will exceed your expectations with outstanding service and results!"], "languages": "", "address": "5015 Tracy Street ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 354-5755", "office_phone": "", "social": "", "website": "", "agent_email": "Kim.Dale@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me302935/kim-dale"}
{"country": "United states", "first_name": "Sunny", "middle_name": "", "last_name": "Wood", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F528-20180221145547164-495.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Driven by a passion for helping people buy and sell homes, Sunny Wood combines unparalleled local expertise with exceptional client service to produce extraordinary results. After moving to Dallas from the East Coast with her husband, Sunny Wood quickly established herself as one of the foremost real estate agents in the region, consistently recognized as a top producer in D Magazine, Neighborhood Advocate, and Texas Monthly. By leveraging her experience, persistence, and can-do positive attitude against some of the toughest economic cycles in Texas history, Sunny continues to raise the bar.", " ", "Asking the right questions and listening to clients' wants and needs have helped Sunny accomplish several benchmarks in her storied career. In the late 90's she was tasked to assist with one of Dallas' first Intown Housing initiatives - the acquisition and development of four historic buildings listed on the National Register of Historic Places, which were transformed into 200 residential lofts. \"These old factories were vacant and in disrepair. The city of Dallas offered funds to developers to save these buildings from the wrecking ball and turn them into living spaces. Now, the downtown area boasts several thousand residential units and a world class Arts District, and the streets are bustling with activity. I am proud to be part of that transition,\" says Sunny.", "A 40-year resident of Dallas, Sunny also enjoys focusing her sales and marketing efforts on the neighborhoods where she and her husband have put down their own roots. Together they raised their two daughters in Lakewood and Lake Highlands, and were actively involved in Booker T Washington High School for the Performing and Visual Arts,", "Now living near the Park Cities, Sunny has expanded her business to include University Park, Highland Park, Preston Hollow, Devonshire, Greenway Parks, Uptown/Downtown Dallas, Richardson, Plano, Farmer’s Branch, Coppell, Frisco, Southlake, and beyond. Her experience in buying and selling homes spans from every corner of Dallas and deep into Texas Hill Country. ", "Sunny is a graduate of the University of Maryland and a member of the Greater Dallas, Texas and National Association of Realtors. She frequently participates in professional development programs to stay current in the marketplace and has earned her Accredited Luxury Home Specialist Designation as well as her Accredited Buyer’s Representative designations. Sunny has established a loyal following of repeat clients and referrals which keep her focused on what matters most-relationships. ", "\"Sunny was the best agent I have ever worked with and my husband and I have bought many homes over the last 25 years,\" said Nancy, a repeat client. \"Her sense of loyalty to us was impeccable,\" explained clients Daniel and Sammy. \"Not only did she help us look at properties, she was at our beck and call until our home was found, and she was there until all inspections were passed, offers were agreed upon, and happiness/ownership was signed sealed and delivered. She will always be the first person we suggest to our friends and family.\"", "From real estate sales and leasing, to high-end developments and property management in virtually every Dallas community, Sunny has the knowledge and business savvy to get the job done. If you are in the market for an accomplished professional to sell your property in record time at the highest possible price, or, looking for an expert to guide you to the perfect Dallas neighborhood, give Sunny a call."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 934-5090", "office_phone": "", "social": "", "website": "", "agent_email": "sunny.wood@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me309314/sunny-wood"}
{"country": "United states", "first_name": "Linda", "middle_name": "", "last_name": "Galli", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-2017083016448759-150.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Linda Galli's passion for everything real estate began 30 years ago in Naples, Florida where she and her partner created a business building new luxury custom homes.  She was actively involved at all levels of the business including construction plans, interior design and sales. ", "Linda moved to the Park Cities 16 years ago with the same passion, expertise and commitment to real estate that has defined her over the years.  With her extensive knowledge, she expanded her business into the resale market as well as high-end renovation.  Linda confidently delivers her best to her clients.", "Together with her daughter, Jackie Converse, who brings her own dynamics to the partnership, Linda and Jackie work passionately for the success of every real estate transaction and for the total satisfaction of each client."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 755-0697", "office_phone": "", "social": "", "website": "", "agent_email": "linda.galli@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0503203/linda-galli"}
{"country": "United states", "first_name": "Shelly", "middle_name": "", "last_name": "Adams", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F2aeff08d-2fbb-432d-be30-a5e120d01721.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Buying or selling a home can be a stressful time. In my opinion buying a house should be fun and selling a property should be a time to look forward to life's next adventure.", " ", "I believe clear and timely communication is the key to success in this business. You will be updated every step of the process and my lines of communication are always open.", " ", "I have a strong work ethic of integrity and accountability in all areas of life, personally and professionally. Clients can expect complete confidentiality during the process and beyond.", " ", "I have been on the relocation team for over 7 years. I have sold all across the DFW metroplex giving me vast market knowledge. Some area of specialty include: Southlake, Keller, Colleyville, North Richland Hills, Trophy Club, Roanoke, Westlake, Grapevine, Haslet, Ft. Worth and surrounding areas. ", " ", "Certified Negotiation Expert, Pricing Strategy Advisor, Certified Home Marketing Specialist, Senior Real Estate Specialist. Top Individual Producer 2015-2021. Awarded the Real Producers award for N. Fort Worth, Top 500 agents in 2022.", " ", "\" I would highly recommend Shelly. She took the time to listen to what we were looking for, had an immediate response to all questions and concerns. As we were out of state and had time restraints, she used our time wisely. Shelly selected the homes to view that met our requirments and was in daily communication with us. I cannot say enough about Shelly, she will be our go to person when we buy our next house.\" -Jody Eaton", " ", "\" I recently lost my husband and was forced to sell our home. Shelly was there every step of the way. Shelly is kind yet unwaivering. She sold our home within 2 weeks of having the listing and over list price.\" -Nancy Tanner"], "languages": "", "address": "550 Reserve St., Suite 320 ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " (361) 537-7382", "office_phone": "", "social": "", "website": "", "agent_email": "shelly.adams@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me299126/shelly-adams"}
{"country": "United states", "first_name": "Fiona", "middle_name": "", "last_name": "Richards", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20190415164115389-750.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["By the time young Fiona Richards was just 15 years old, her father's career in the Air Force took the family to six different cities, from her birthplace of Bitburg, Germany, to San Antonio, Texas. With each move, Fiona's mom encouraged her to check out the neighbors and gather information on what we have in the community. By the end of the day, Fiona would come home with a cadre of friends and colorful anecdotes about each of the neighbors.", "It should come as no surprise that Fiona was drawn to residential real estate as her career. Matching people with their homes is a process that comes naturally to her, and she considers being an agent the highest compliment: A home is the safest haven, and it's the bedrock of a family.  ", "She started in residential real estate in 1982, working as an on-site sales person in Allen, Texas, for Pulte Homes, one of the largest national homebuilders. At that time, the new development was experiencing a dry spell — not a single home was sold in six months. With Fiona's natural ability to connect with people and her genuine desire to help, she sold all the builder's inventory and had 10 houses under construction in just three months. Within a year, she was promoted to sales and marketing director, where she spent the next few years developing a growing sales force to grow the Pulte brand. ", "She left the company to start her own firm, Fiona & Company, where she consulted with leaders in the industry to help them gain market share by offering sales training, marketing and advertising services. ", "Fiona joined Briggs Freeman Sotheby's International Realty in 1997 in marketing and agent services, in 2010 she joined the Nobles Baldwin Group with a focus on the luxury residential market where they were a consistent top-producing team.  Recently, Fiona joined Susan Baldwin to form the Baldwin Group at Allie Beth Allman & Associates.", "A member of the top-producing Baldwin Group and resident of University Park for 25 years, Fiona provides incomparable service in luxury real estate in such neighborhoods as the Park Cities, Preston Hollow, Caruth Homeplace, Lakewood, Devonshire and Frisco.", "Fiona treats her clients as if they are extended family, and their best interests are at the heart of all that she does. They describe her as encouraging, attentive and responsive, as well as detail-oriented, creative and persistent. Above all, she's a hustler on their behalf, including in negotiations.", "Her bespoke method for listing and selling homes combines creativity with dogged determination. She spins creative solutions to sell her properties by designing original marketing plans for each. She styles every room in her homes for maximum impact and oversees photography and video that beckons guests to see it firsthand. She enthusiastically demonstrates homes to prospective buyers, helping them see themselves in that home during the process. ", "With a dedication to the community in which she lives and works—what Fiona considers her extended family—she also devotes time to charities. Those closest to her heart include the Council for Life, Gladney Center for Adoption, 1 Million 4 Anna, Reformed University Fellowship at the University of Texas at Austin, Camp John Marc, Student Ventures, Kershaw's Challenge and Arise Africa.", "Fiona passion's for helping people find their own safe havens in communities that feel like home defines her work in the Dallas luxury real estate market. Those looking to buy or sell a home in Dallas #GoWithFiona for personal service that reaches for the sky."], "languages": "", "address": "5015 Tracy St 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 632-5813", "office_phone": "", "social": "", "website": "", "agent_email": "fiona.richards@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me318621/fiona-richards"}
{"country": "United states", "first_name": "Sergio", "middle_name": "", "last_name": "Manriquez", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F528-20180123210553302-678.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Sergio & Sheila Manriquez- Realtor ®", "Sheila and Sergio Manriquez are passionate agents who have joined forces to provide the ultimate full-service home buying experience. Those who work with them have two dedicated advocates on their side with complementary strengths and a shared drive to deliver everything their clients want and more. They are self-described hustlers who won’t' stop until they accomplish what they set out to achieve.", "Sergio Manriquez grew up in Dallas and knows the business side of real estate through and through. He arrived on the scene over a decade ago, and quickly made a name for himself brokering deals with high-dollar investors. He boasts extensive banking experience, a skill that serves him well come negotiating time. Sergio's calm demeanor is helpful during stressful negotiations. He wants his clients to be happy and is a true go-getter when it comes to finding the right deal.", "As a Dallas native, Sergio has observed and experienced the exciting growth of the Dallas metropolis and its surrounding areas. He is a Southern Methodist University Graduate with an Economics degree. He is experienced in high-end home sales and listings, while specializing in the Park Cities, Preston Hollow and surrounding areas. Sergio knows the communities, the lifestyle, the people, and what makes the city thrive. Sergio began his career in the banking/financial industry. He has worked for some of the top financial institutions like JP Morgan Chase, BBVA Compass, and Money Gram International.", "Sheila Manriquez brings a love for real estate and a commitment to getting the deal done. She believes that building strong relationships is the key to truly understanding and delivering what they want. An SMU graduate and lifelong Dallas area resident, she started on the commercial side where she excelled at coordinating projects of varying sizes. Her attention to detail garnered numerous accolades and ensured that the projects she was responsible for were successfully completed in good order. Sheila moved to residential real estate because she wanted to help families find the home of their dreams. When working on a project, she takes pride in going the extra mile and exceeding her clients' expectations.", "She is experienced in high-end home sales and listings, while specializing in the Park Cities, Preston Hollow and surrounding areas. She is a motivated agent, who brings a relentless work ethic to the residential real estate market. Sheila began her career in the tax consulting and banking industry while simultaneously graduating from SMU. She has worked for prominent companies like Ryan Inc., JP Morgan Chase, Texas Capital Bank, and Hillwood Commercial (A Perot Company). Sergio and Sheila know that real estate is about more than transactions. It's understanding the market, building relationships, and providing a one-of-a-kind experience that can’t' be topped. Sergio and Sheila don't rest until they close the deal. They ask the right questions, attend to every detail, and always put their client's needs first.", "Our Mission Statement: Sergio and Sheila believe strongly in Trust, Integrity, and Commitment. We pledge to be the best fiduciary for our clients and create lasting relationships. We hold ourselves to a standard of excellence, that delivers CONSISTENT RESULTS! We measure our success by exceeding your expectations and working closely with you to find the perfect fit. After all, it's arguably in most cases, the most important investment you will ever make. Their primary goal is to help you navigate through the real estate process with the least amount of stress on your part. We look forward to the opportunity to help YOU achieve your goals.", "It's not all work for Sergio and Sheila, though. Socially they are fitness enthusiast, dancers, and love spending time with their loved ones. Sergio and Sheila have a passion for traveling along with inspiring and motivating others."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (469) 767-8819", "office_phone": "", "social": "", "website": "", "agent_email": "sergio.manriquez@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me309169/sergio-manriquez"}
{"country": "United states", "first_name": "Brettne", "middle_name": "", "last_name": "Hemley", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F272938e6-9afe-4687-8452-892098332049.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["After graduating college with a Marketing degree, specializing in visual merchandising, Brettne wasn’t really sure what she wanted to do and how she wanted to use her degree.  One thing she did know- she loved working with people. Many close friends and family brought it to her attention that Real Estate provided the perfect opportunity for her to combine her love of people, her outgoing personality and her social skills. She immediately started working on obtaining her license and from there hit the ground running!", "In the business since 2004, Brettne definitely has lots of experience and the knowledge to help her clients navigate the whole real estate process from start to finish, whether they are buying, selling or both!  She is truly passionate about her career and making sure her clients are 100% satisfied.  She has the ability to connect with each one of her clients and make them feel as if they are always top priority.  Brettne is incredibly caring, loyal, honest and most importantly a good listener.  “She took time to listen to our specific concerns and accommodated our needs throughout the engagement”, says one client.  Know that if you choose her as your realtor, you will not be disappointed!"], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (713) 256-7582", "office_phone": "", "social": "", "website": "", "agent_email": "brettne.hemley@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322450/brettne-hemley"}
{"country": "United states", "first_name": "Sitara", "middle_name": "", "last_name": "Richard", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2Fe88ababa-290a-4a29-be38-19f94961d5aa.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Moving across the world multiple times has given Sitara Richard a true appreciation for the importance of home. She’s a firm believer that no matter where life takes you, everyone needs a special place that is truly their own. This passion motivates her to help people achieve their real estate goals.", "The key to Sitara’s success is her ability to not just listen to clients but also deliver what they want. She is a Dallas area native with experience in both the residential and commercial markets. That, coupled with a lifetime’s worth of connections, allows her to deftly navigate the hyper-competitive environment. She also understands that her job is more than just helping people find a house, it’s helping families find happiness for years to come.", "Serving others is second nature to Sitara. She’s worked in community development in Fiji, lived at an orphanage in Trinidad, and served as an athletic director at an international school in Africa. These experiences only reinforced her belief in advocating for those in need and contributing to a greater good. ", "Being part of a winning team is also very familiar to Sitara.  As highly recruited college basketball player, she excelled at working with her teammates to reach a common goal. She brings a similar mentality to the team at Allie Beth, only now her mission is giving clients the support they need to make one of life’s most important decisions. As always, she’s eager to serve and determined to succeed. ", "Sitara is a member of The Lillie Young Group, a team of exceptionally qualified real estate professionals with proven track records and over 100 years of combined real estate experience. The top producing Lillie Young Group has sold over $1.5 billion in residential real estate and has been consistently recognized by D Magazine as one of Dallas' top real estate teams. "], "languages": "", "address": "5015 Tracy St, Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 235-1201", "office_phone": "", "social": "", "website": "", "agent_email": null, "profile_url": "https://www.alliebeth.com/associate/528-a-me322581/sitara-richard"}
{"country": "United states", "first_name": "Georgia", "middle_name": "", "last_name": "Nolan", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F91d88445-f399-41c5-9254-6687ac075732.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Georgia Nolan Gunter was born and raised in the Park Cities, with roots going back four generations in the neighborhood. Georgia has sold $35 million of real estate all over Dallas in her four years as an agent and has been recognized as a “D Best” Realtor three years in a row. Georgia serves her clients’ needs with her know-how mentality, endearing personality, and unmatched customer service.", " ", "After graduating from Highland Park High School in 2013, Georgia attended Texas Tech University where she earned her bachelor’s degree in Finance with a concentration in real estate. Georgia and her husband, Garrett, recently moved into the Devonshire area with their daughter, Nolan.", " ", "Georgia finds joy in connecting with clients throughout the home buying process and making new friends along the way!"], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 264-9022", "office_phone": "", "social": "", "website": "", "agent_email": "georgia.gunter@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me324688/georgia-nolan-gunter"}
{"country": "United states", "first_name": "Bianca", "middle_name": "", "last_name": "Tuma", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20170929130345309-483.jpg", "title": "Real Estate Professional", "office_name": "", "description": [], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (469) 878-0221", "office_phone": "", "social": "", "website": "", "agent_email": null, "profile_url": "https://www.alliebeth.com/associate/528-a-180-me308623/bianca-tuma"}
{"country": "United states", "first_name": "Karen", "middle_name": "", "last_name": "Luter", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81688%2F13fd05f6-a52c-47c9-b4ca-318fce5edaae.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Karen Luter made her mark as a high-performance real estate practitioner in 1982. Only 6 months after she received her Brokers license, she logged in several multi million dollar sales and earned the distinction of Rookie of the Year.  She has been garnering awards of distinction ever since, including the coveted D Magazine Best Realtor year after year.  ", "Karen is detail-oriented with a creative bent and strategic view of the big picture.  She is highly-organized and knows how to satisfy a demanding, discerning client. No surprises.  Detailed research.  Anticipation of needs.  Complete preparation.  Brilliant negotiating.   The competitive edge.  Tenacious with a warm, personable side.  ", "She honed her skills in the business world with a career foundation in executive assistant roles, marketing a luxury jet aircraft, working in the corridors of power at the top of the Dallas business community.  ", "Today, she draws on the same bounty of talent, skills and depth of knowledge to deliver unparalleled service to clients. ", "A Dallas native, Karen grew up in Lakewood, the daughter of a dentist and graduated from Woodrow Wilson High School.  She raised her own family in Dallas.  She knows the sense of home, community and the unique characteristics of Dallas residential neighborhoods -- selling today in Park Cities, Preston Hollow, Lakewood and throughout the DFW Metroplex.", "She evolved her real estate expertise as Dallas itself grew and developed -- acquiring unique niches of specialization and portfolio of cumulative market knowledge that makes her an invaluable advisor to new as well as longtime clients and their families.  ", "In addition to traditional single family residential, Karen has diverse areas of experience and expertise that includes condominiums, high-rises, townhomes, investment properties, ranches and even international properties.", "On the developer side, she created full marketing plans and led on-site sales for Wellington on the Creek, a single family home development in Bluffview and Portobello by the Creek, luxury townhomes in West Village, selling each of these master planned communities ahead of projections. That experience gave her a better understanding of construction, design and staging that has helped her guide her clients every day since. ", "Karen is well-networked and well-respected within the real estate, legal and financing community, an invaluable asset for buyers and sellers who benefit from her insider knowledge, longtime relationships and instant rapport with industry colleagues who come into play in each unique transaction.  ", "From expertly staging each photograph to perfection for a new listing to preparing winning contracts for her buyers, Karen throws the full force of her energy and creativity into developing a vision for each client. That is a big part of Karen's formula for success in the fast-moving Dallas real estate market. This multimillion-dollar producer works hard and doesn't stop. ", "When she is not guiding real estate transactions, she is giving back to the city she loves through her participation as a member of the Board of Nexus Recovery Center for Women and as founder of their highly successful fundraising gala, A Night for Nexus. She is also the founding member of one of Dallas most successful Business Networking International groups situated in The Tower Club.  She also enjoys cheering on the Highland Park football team, where her grandson was a standout, or visiting a movie set to watch her actress granddaughter Tatiana or exploring the contemporary art scene. "], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (214) 727-4747", "office_phone": "", "social": "", "website": "", "agent_email": "karen.luter@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-0299518/karen-luter"}
{"country": "United states", "first_name": "Brandi", "middle_name": "", "last_name": "Bragg", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=http%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F528-20171228014953887-316.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Brandi joins the firm having enjoyed a successful year in real estate, responsible for sales exceeding 10 million dollars. With her expertise predominantly in the Park Cities and Preston Hollow, Brandi also has extensive knowledge and experience in areas such as Devonshire, North Dallas and Plano.", "Prior to real estate, Brandi worked in corporate sales and managed her own interior design business.Her excellent skills in sales and invaluable experience in home design have been a natural fit for selling and finding homes.", "Brandi is passionate about connecting her clients with the perfect home. Clients appreciate her keen design sense, strong negotiating skills and vast knowledge of the Dallas residential real estate market. For the past 4 years, Brandi has been building a solid client base, frequently going above and beyond what is expected in all areas of a transaction.", "Currently residing in University Park, Brandi has always been involved in the community in which she lives. She has been a longtime supporter of her children's education,volunteering in their schools and neighborhood projects.  Brandi is also past member of the JUnior League of PLano, a member of the University of Texas at Dallas Alumni Association, and St. Michaels and All Angels Episcopal Church."], "languages": "", "address": "5015 Tracy Street Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " 214-763-6755", "office_phone": "", "social": "", "website": "", "agent_email": "brandi.bragg@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-81688-me294333/brandi-bragg"}
{"country": "United states", "first_name": "Nataliia", "middle_name": "", "last_name": "Graves", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F34ac9385-1ec1-475c-a351-792753ad514d.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["With support of a great team at Allie Beth Allman, Nataliia strives to provide excellent service weather you are buying or selling a home. She values her clients and enjoys her profession. Buying and selling a home is an emotional experience and she is here to ensure that process is a positive one. The combination of her experience and teamwork will deliver a great home buying or selling experience. She loves people, enjoys her profession and values her community. Nataliia is getting her Master’s in Law at Southern Methodist University."], "languages": "", "address": "5015 Tracy St., Suite 102 ", "city": "Dallas", "zip_code": "75205", "state": "Texas", "agent_phone": " (806) 681-6132", "office_phone": "", "social": "", "website": "", "agent_email": "nataliia.graves@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322052/nataliia-graves"}
{"country": "United states", "first_name": "Tracey", "middle_name": "", "last_name": "Vigano", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F86008af6-111d-41fd-b723-c5af6dfcc4ed.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Tracey came into the real estate profession as an accomplished and highly successful business professional with 25 years of experience leading and managing high volume luxury specialty and department store teams.", " ", "Tracey’s passion for creating memorable client experiences, resourceful problem-solving skills and extensive strategic negotiation skills, created a natural transition into the real estate industry, in which she has a long-standing interest. Her discerning eye for fashion and design, along with her personal experience in real estate investment and management, has further prepared her for the real estate profession.", " ", "Tracey is excited to start a new profession, helping others realize their dreams in a new home.", "She believes that buying and selling a home are truly emotional experiences and, in some cases, some of the most important lifetime decisions made.", " ", "A New Jersey native and graduate of The University of Maryland, Tracey holds a BS in Marketing. Tracey relocated to Trophy Club in 2015 with her husband and 3 dogs. Since living in the DFW area, Tracey has worked in towns spanning across the DFW market, giving her exceptional knowledge of many communities and neighborhoods.  When she is not working, Tracey enjoys traveling, cooking, reading and taking long walks and hikes with her husband and ", "fur babies", " and stays busy serving as a board officer of her rental property HOA. "], "languages": "", "address": "550 Reserve St., Suite 320 ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " (973) 207-0412", "office_phone": "", "social": "", "website": "", "agent_email": "tracey.vigano@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322422/tracey-vigano"}
{"country": "United states", "first_name": "Denise", "middle_name": "", "last_name": "McCormick", "image_url": "https://www.alliebeth.com/localimagereader.ashx?imageurl=https%3A%2F%2FRealEstateAdminImages.gabriels.net%2F528%2F81689%2F023c2df1-18d7-425c-a394-e1308670a303.jpg", "title": "Real Estate Professional", "office_name": "", "description": ["Denise believes in total collaboration with her clients and views the experience of purchasing or selling a home as a true partnership. Whether you are listing your home, moving within the area, or relocating to the DFW Metroplex, she will be there every step of the way.  Denise has been a Texan for nearly 30 years, living and working in Dallas, Irving, Plano, Grapevine, Southlake, Lantana, Argyle and Flower Mound.  ", "Having raised three sons in Southlake she is acutely aware how important finding the ideal city, school, community, and neighborhood is to each client and their family.  If you need a recommendation for a select sports team, pediatrician, new car, or restaurant, Denise knows where to send you, (and those are just a few examples.) ", "If you are selling your home, she will assist with staging and repairs, whatever it takes to make your home a showcase.   Behind a solid marketing plan and the power of the Allie Beth Allman luxury brand, she leaves no stone unturned to sell your home, resulting in a solid buyer for the best price.   Previously working for a developer, she has built strong relationships with custom builders, architects, and other professionals in the area.  With strong negotiation skills, attention to detail and excellent communication, Denise will provide you with a professional and rewarding experience.  Enjoy \"concierge\" service before, during and long after the sale.  "], "languages": "", "address": "550 Reserve St., Suite 320 ", "city": "Southlake", "zip_code": "76092", "state": "Texas", "agent_phone": " ( 817) 313-4608", "office_phone": "", "social": "", "website": "", "agent_email": "denise.mccormick@alliebeth.com", "profile_url": "https://www.alliebeth.com/associate/528-a-me322162/denise-mccormick"}
